//12main7_1
//Циклы JavaScript
//for,while,do while

//цикл for
//сначало делаем пер-ую,потом говорим до когда цикл будет идти(условие)
//и потом что делаем с пер-ой(плюсуем к i единицу)
//если в одну строчку,то {} можно не ставить


// for(var i = 0; i < 10; i++){
//     console.log(i);
// }
// for(var i = 100; i > 10; i-=10){
//     console.log(i);
// }

//цикл while

let i = 0; //надо создавать пер-ую вне цикла
while(i < 10){
    console.log(i);
    i++;
}
let j = 1;
while(j <= 100){
    console.log(j);
    j *= 2;
}

